Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 荣管事见江逸没出去，反而狡辩起来顿时怒了，没等江逸说完一拍桌子就站了起来准备训斥几句。不过他突然一怔，眼睛猛然睁大，问道：“你说什么？谁让你去帮忙？柳长老？是炼丹房的柳长老吗？”
en_us: Upon seeing Jiang not only not leave, but instead try to defend himself, Chief Rong instantly flew into a rage. Without waiting for Jiang Yi to finish his sentence, he slammed the table and stood up, ready to scold the boy. However, he suddenly appeared startled, his eyes abruptly expanded, as he asked, "What did you say? Who asked for your help? Elder Liu? You mean, the Elder Liu from the alchemy lab?"

source: 荣管事说不定哪天就会来追要令牌了，江逸时间紧迫，也顾不了那么多了，开始在里面转悠寻思炼丹。
en_us: There was no way to know what day Chief Rong would suddenly come to demand the command token. Jiang Yi was tight on time. He decided not to worry so much. Instead, he started pondering on how to refine elixirs.

source: 荣管事重重一哼，直接打断他的话：“没清点完毕，你跑这干什么？这里是你能来的地方？还不快滚去西山清点？”
en_us: Chief Rong snorted loudly, directly interrupting him. "What are you doing here, since you're not done counting? Is this a place you can even come in? Hurry up and run back to the Western Hills for accounting!"

source: 莫非……
en_us: Unless...

source: 莫非……她们遇上了什么隐世的大仙门不成？众人心底顿时有些激动，就连郁红眼睛都亮了几分，开始重新审视起前方这两人。
en_us: Could it be… they had met an amazing, hidden immortal sect? Everyone grew excited and even Yu Hong's eyes brightened up as she began to see these two from the Invincible Sect in a new light.

source: 莫非眼前这个女子，有什么特别之处。
en_us: Could this girl be special in some way?

source: 萝卜一愣，整个人像是霜打的茄子一样蔫了下去，眼里顿时涌上了两泡泪花，哪还有刚刚惊艳的样子。
en_us: The radish was stunned. Its entire body went limp like a shriveled eggplant and its eyes began to well up. It no longer had the glamor and beauty it had before.

source: 萝卜一路控制着法器往回飞。他们来时，孤月在路上布了几个传送的法阵，所以比起之前来，她们只花了不到半个时辰，就到了上青界与妖界的交界处。
en_us: The radish was controlling the Dharma artifact the whole way back. Lonemoon had left some transportation arrays on their way to Upper Azure Town, hence the return journey took less than an hour and they arrived at the border between the Upper Azure World and the Demon Realm.

source: 萝卜呆了一下，顺着她指的方向瞅了瞅，然后掷地有声发出响亮的一声：
en_us: The radish hesitated before it turned to look in the direction that her finger was pointing. Then, it turned back around and made a sound:

source: 萝卜心碎了一地。
en_us: The radish's heart broke into little pieces.

source: 萝卜捂着肿成猪头的脸，蹭的一下可怜兮兮的缩回了原形，原本白胖的萝卜，已经变成紫的了。
en_us: The radish's face swelled up and in the next second, it turned back into its true form. The once white, fat radish was now purple.

source: 萝卜眼神一冷，叭的一下，一巴掌拍开了他的手，掷地有声的道，“滚开，丑逼！”
en_us: The radish's expression became cold. It smacked Lonemoon's hand away and shouted, "Get lost, Ugly!"

source: 萝卜精原本还带着青色的身体，瞬间被吓成了惨白色，也不装植物了，在那巨兽啃下来的瞬间，噌的一下从坑里跳了出来，慌不择路的在四周惊恐的乱跑起来，“叽叽叽叽叽叽……”
en_us: The radish's body had a slight green tinge to it at first, but now it was purely white. It could no longer pretend it was just a motionless plant. Just as the beast's teeth hit the soil, the radish jumped out of the pit, panic-stricken. It started to run around in circles exclaiming, "Ji ji ji…"

source: 萝卜脸色一白，都快哭出来了，“我开，我开还不行吗？”
en_us: The radish's face turned pale and became on the verge of crying. "I will make them bloom, I will, alright?"

source: 萝卜被看得一抖，下意识的就抱胸后退了一步，“干嘛？我卖艺不卖身的！”
en_us: The radish shivered under their stares, subconsciously hugged its chest and took a step back. "What? I sell my skills but I do not sell my body!"

source: 蓝衣妹子。
en_us: Blue shirt girl.

source: 薄仪：“……”
en_us: Bao Yi, "..."

source: 薄家两父子越加好奇了，纷纷上前道，“仙子不用害怕，我们只是想见识下贵派高招而已。”
en_us: The Pu's father and son were even more curios now and said respectively, "Don't need to be scared. We just want to take a look at your sect's abilities."

source: 薄家两父子，每次见到这种场景，脸色就更绿一分。直到了解到整个无敌派，确实全都是女体修后，他们的脸色就更精彩了，眼神中充满了绝望。
en_us: Every time the Pu father and son see this, their faces would turn slightly more green, which became even more interesting when they finally understood that the entire sect were female Body cultivators. Despair was engraved in their eyes.

source: 薄家二人：“……”
en_us: Pu's father and son were left thoroughly speechless.

source: 薄家父子和其它弟子也围了上来。
en_us: The Bao father and son, and their disciples huddled together as they came forward.

source: 薄飞平仍是不敢置信的扫视了他好几遍，虽然九霄亿镜有着半条仙脉的仙气，确实可以让人的修为突飞猛进，但……这也进得太多了点吧？
en_us: Pu Feiping scanned Yi Qing up and down repeatedly. He simply could not believe his eyes! Even though the Infinity Cloud Mirror did carry with it half of the Immortal Qi from an immortal's pulse, and thus could help people rise through the levels of their cultivation, but this... this is a bit too much, isn't it?

source: 薄飞平手一抖，连探查的法术都没维持住，面前的水镜哐的一下就碎了。心底全都是慌乱，一时间之前所有想不通的事，全都想通了，为什么那个魔族会突然消失？为什么到处都找寻不着它的踪迹？为什么它能轻易突破城外的破魔阵直接进到城主府？
en_us: Pu Feiping's hand was shaking, and could not even maintain the Dharma spells that were used to scan the city, causing the water mirror in front of them to shatter into pieces. Now his mind was in a mess. Previously whatever he did not understand, all made sense to him now. Things like why did the Demonic beast suddenly disappear, why could they not find any traces of his tracks anywhere, and why could it easily break through the city's shield against demons and directly enter the city, all became clear to him.

source: 薄飞平点了点头，这才带着几人去了偏院。孤月把沈萤所说出现过魔界之门的地方，反复查看了十几遍，如薄飞平所说没有任何异样。
en_us: Pu Feiping nodded and brought them to the remote building. Lonemoon kept cheecking the place where Shen Ying said she had seen the Door of Demon realm repeatedly, but to no avail. It was just like what Pu Feiping had mentioned. There was nothing suspicious about the place.

source: 薄飞平：“……”
en_us: Bao Fei Ping, "..."

source: 虽然他们现在只有三个人，前期可能会辛苦点，但他好歹也是管理过几百万人大公司的人，对这些事情很熟悉。至于术法学习之类的，羿清和他都是剑修，可以先招收几个资质好的剑修弟子。而且他精通阵法，羿清精通练器，有合适的弟子，也可以传授。练丹御兽，就只能靠自学了。
en_us: Although there were only the three of them now and the road ahead looked difficult, Lonemoon had experience in managing a company of millions of workers. He was all too familiar with these matters. As for training in sorcery, both he and Yi Qing could handle it. They were sword cultivators after all—they could recruit disciples who were talented. While Lonemoon was proficient in array formations, Yi Qing was proficient in weapon refinement. They could pass down their skills if they found suitable disciples and they could also allow their disciples to pick up pill-refining and beast control on their own.

source: 虽然他知道剧情，但却发现自己距离书中那些情节发展的时间，还很遥远。同为剑修，难免对剑仙有些好奇，本以为真要见到，估计也是他飞升成仙后的事情了。
en_us: Although he knew the storyline, he realized that he was quite far back in the timeline before those events happened. Since they were both sword cultivators, it was no wonder that he grew curious of the sword immortal. He thought that even if he really were to meet him, it would be after his Immortal Ascension.

source: 虽然修仙一途向来就是逆天而行，自踏上这条路开始，他就做好了赴死的准备。但此刻，他担心的却是屋内的人，他死不要紧，可恩人怎么办？恩情未报，绝对不能让她出半点事。
en_us: Although immortal cultivators had always done things that went against the will of heaven, he had prepared himself for death once he had embarked on this path. But at this moment, his concern was with the person in the house. His death did not matter, but what about his benefactor? He would never let anything endanger her before his debt was repaid.

source: 虽然厨艺一言难尽，经常做得焦的焦糊的糊，好在不用饿肚子。会说话的小动物肉吃着有些别扭，但吃着吃着……也就习惯了！
en_us: Although her culinary skills were not exactly out of this world — more often than not, the food would be burnt or overcooked — but at the very least she would not go hungry. Eating the meat of animals that could talk felt a little awkward but the more she ate, the more she grew used to it.

source: 虽然听不懂，但是……这种想吐血的冲动是怎么回事？他堂堂丹阳宗的极品丹方……真的过……过时了吗？
en_us: He didn't understand, but… why did he suddenly feel like he was about to vomit blood? All these recipes for supreme-grade pills and elixirs from the honorable Dan Yang Sect are… really… outdated?

source: 虽然她们是比剑修还强悍的体修，但这一年来学习的攻击手段全是剑招，又没有跟人对战过，缺乏经验。甚至之前那些阴柔的术法，她们估计也不会再用。
en_us: Although they were Body Cultivators who were tougher than Sword Cultivators, the offensive techniques they had learned in the past year were all sword moves and none of them had actual battle experience. Moreover, the gentle sorcery they had previously learned would most likely not be of use.

source: 虽然方式太过惊心动魄了点，但好在结局还算可以接受。
en_us: Although the method used had terrified him a little, the rewards more than made up for it.

source: 虽然此时的他鼻青脸肿，但他……很强！特别强，就算是全盛时候的天帝辰戈，也不会是他的对手！
en_us: Even though he badly battered, he was...strong! Extremely strong! Even the Celestial Emperor Chen Ge, in his prime, would not be his match!

source: 虽然现在轩辕家是没理由再发作了，但只要那草木灵在这一天，他和师父一天还是玄天宗的人，他们就不会放过玄天宗，上界世家想对付下界的宗门，多的是不见血的手段，时间久了不保这些人不会对他们生出怨恨来，到不如走了干净。
en_us: The Xuan Yuan Family no longer had any reason to destroy Blackheaven Sect. However, as long as Shen Ying and Yi Qing had the Thousand Leaves Vegetation Spirit, the Xuan Yuan family would count them as one with Blackheaven Sect. The Upper World rarely had to resort to violence to deal with families from the Lower Realms. As time went by, nobody could guarantee that these sects from the Lower Realm would not hate the families of the Upper World, so it would be much more worth it for the Upper World families to make a clean break.

source: 虽然能成功飞升成仙的人少之又少，但飞升之人大多都出自四大家族中。而且世家实力强悍，皆有几十名化神的高手，坐镇的兵解游仙每家也四五位。
en_us: Although fewer and fewer people could achieve Immortal Ascension, most of the people who had achieved Immortal Ascension came from one of the four aristocratic families. Moreover, the aristocratic families were incredibly strong—they each had dozens of Soul Formation experts and four or five presiding Traveling Immortals.

source: 血性的虎王顿时看不过去了，虎鼻一喷，狠狠的道，“哼，你个没种的小子，区区几个修士就把你吓住了，还变做这般模样。”妖皆可化形，但这是万妖大会，所以这里大部分妖族都露了点原型以区别种族，就只有她保持着完整的人形，这让虎王更加看不顺眼了，“不敢以原形示人，你到是个什么妖？”
en_us: The hot-blooded Tiger Monarch could not stand for any of this. Snorting angrily, it said fiercely, "Hmph, you gutless fellow. To think a few mere cultivators are able to scare you to the point of assuming such a form." Demons possessed the ability to morph themselves, but this was the Myriad Demon Congregation. The demons gathered here were in their true forms yet she had chosen to retain her human form instead. This irritated the Tiger Monarch even further. "You do not dare show your true form to us? What kind of demon are you?"

source: 血液是滚烫的，一般都是碱性的，一旦进入眼睛内会腐蚀眼睛内的神经，让对方暂时失明，甚至眼部受创。
en_us: Blood was boiling hot and normally alkaline in nature. Once blood entered the eyes, it would corrode the nerves within the eyes, leaving the opposing party temporarily blind and even causing damage to the eye itself.

source: 血狐一惊，刚要收回狐尾，沈萤却突然用力一扯，顿时一道血光喷溅而出，狐妖剩下的六根狐尾被齐根拉断。
en_us: The blood fox was shocked. He wanted to retract his tails, when Shen Ying suddenly pulled with great force, and blood immediately splattered out. The blood fox's remaining six tails had been pulled out in one go.

source: 血狐大吼了一声，身后剩下的七条尾巴也猛的变长，似是利刃一般从阵法里飞了出来，攻向两人。
en_us: The blood fox let out out a loud roar. His remaining seven tails, which had suddenly grown longer, shot out of the array formation like sharp blades towards the two of them.

source: 血狐笑得更大声，“玄天宗又怎么样？这里就只你们俩个，加上一只不成气侯的狸猫，只要杀了你们，谁知道这阵是我布的。”
en_us: The blood fox's laughter grew louder. "Blackheaven Sect, so what? There's only two of you here, plus one less than qualified civet cat. As long as I kill all of you, who would know that I was the one who set up the array."

source: 血狐脸上却全都是兴奋，眼中隐隐还有些疯狂之意，一边抱紧尾巴上的婴儿，一边呢喃，“吸收了这紫霞玄芝的灵气，我儿很快……很快就会醒过来的。”
en_us: In contrast, the blood fox looked greatly excited, the expression in his eyes revealing a hint of madness. Holding the baby on his tail, he muttered, "Once he absorbs the aura of this Splendor Lingzhi, my son will soon… soon awaken."

source: 血狐身上的血煞之气瞬间暴涨，连着整个空间都刮起了一阵阴风。孤月眉头一皱，跟羿清对视了一眼，再没有心情跟这个明显已经疯了的狐妖废话，双双冲了出去。手间剑招变换，一时间满目都是剑光。
en_us: Suddenly, the baneful Qi in the blood fox surged and a gust of Yin wind buffeted the entire space. Furrowing his brow, Lonemoon exchanged looks with Yi Qing. Not wanting to continue talking nonsense with this fox demon who had obviously gone insane, both of them rushed forwards. Within moments, the whole area was filled with flashes of light from the blade of their swords as they seamlessly switched from one sword move to the next.

source: 血狐：“……”
en_us: Blood fox: "..."

source: 血？孤月一愣，立马走了过去，看向那水淋淋的山壁，本以为这里的土质偏红色，细一看才发现，哪是偏红，分明就是被血染红的。
en_us: Blood? Puzzled, Lonemoon immediately walked over and looked at the dripping mountain wall. He had attributed the redness to the soil here being reddish. Upon closer examination, he realized that the stuff covering the wall was not red soil at all; it was blood.

source: 被人尊重和感激是很愉悦的事情，尤其还是个漂亮小姐。江逸在江家从未受到如此待遇，反而在外面受到了姬家小姐和这位翊小姐的高规格待遇，心情自然大好，摆手道：“小姐客气了，我一定全力以赴。”
en_us: To receive respect and gratitutde was a very delightful thing, especially since it came from a pretty young lady. Jiang Yi had never experienced such good treatment at the Jiang Clan; on the other hand, to receive such high-standard treatment outside from the young mistress of the Ji Family and this Young Mistress Yi, his emotions naturally improved greatly. He waved his hands and replied, "Young Mistress, you are too courteous. I will definitely give it my all."

source: 被强塞了一袋海鲜的白泽：“……”他没想要这个啊？
en_us: Bai Zhe, who had the bag of seafood forcibly stuffed at him: "..." He had not asked for this?

source: 被甩了个背景的，“……”啥意思？
en_us: He turned his back toward her. "..." What's that supposed to mean?

source: 被说破身份的那天，说实话，他是真的被吓到了。想确认，又怕去跟她确认。这种突然知道，自己不是老天爷，唯一的小甜心感觉，谁懂？！谁理解？！
en_us: The day that his identity was exposed, in all honesty, he was truly shocked. He had wanted to verify her identity but at the same time was afraid. Such an unexpected revelation that he was not all-powerful took away the only bit of sweet joy in him. Who could understand that!? Who could understand that!?

source: 西院一个破败的小院子内，江逸大口大口的扒着饭，江小奴却蹲坐旁边满脸傻笑，手里拿着一片亮晶晶的紫色金叶子，感觉一切都是那么的不真实。
en_us: In a small poorly-maintained courtyard of the Western Court, Jiang Yi swallowed down big gulps of rice as Jiang Xiaonu squatted beside him, her face grinning foolishly. As she held the bright, sparkling piece of purple gold leaf, she felt as though all of it was quite surreal.

source: 要不……
en_us: Why not...

source: 要不要这么没节操啊喂，还真就答应了。
en_us: Why must you agree so readily? Can't you show a little backbone?

source: 要不要这样，揍人还带接力的啊喂。
en_us: Do you have to go to this extent - that you would find a substitute to punch someone?

source: 要想伤势尽快复原，关键在于外药内调。
en_us: The most important factor behind the speedy recovery of any wound was to apply medicine on the exterior and “regulate” from the interior.

source: 要打，他身上没有黑色元力了，不说没受伤的护卫还有两人，这管事明显实力也不低。打下去结局只有一个，他爬着回江家……
en_us: If he chose to fight, there was no more black essence force in his body. To say nothing of the two uninjured guardsmen still available, the housekeeper himself evidently had power at a level that was not considered weak. There would only be one outcome should they fight: that of Jiang Yi crawling back to the Jiang Residence...

source: 要知道修士一般契约的灵兽，都是喜欢栖息在陆地上的，水族由于限制多，所以很少契约。而且水族在陆上战斗力大减。但在水中却不一样，这幻海明显是他们的主战场。
en_us: Cultivators usually sought to contract spirit beasts that lived on land. Aquatic beasts, which had more restrictions, were deemed unsuitable for contract. Moreover, aquatic beasts made poor warriors on land. But it was a different story when they were in the sea; the Mirage Sea was obviously their natural battle ground.

source: 要知道这次参赛的可是有上千个门派，特别是四大世家的人。那些可都是年轻一辈的佼佼者。哪一个不是世家精心陪养出来的人才。就单这十个人中，除了无敌派以外，其它几人几乎全都是世家弟子。以至于接连出现的四个无敌派的名字，就特别明显。
en_us: Thousands of sects had taken part in the competition today, including the four aristocratic families. They were the younger generation of leaders, each one of them trained and nurtured by the people from the aristocratic families. Everybody else who made it to the top ten list, apart from those from the Invincible Sect, were from the aristocratic families. This was only to be expected.

source: 要闹，那更不可能，江家离开这并不远，一旦传回江家此事后果更加严重，那剩下唯有按对方的要求办了。
en_us: If he chose to complain further... that option was even more improbable. The Jiang Residence was not far from here. Should this incident get spread to the Jiang Clan, the consequences would be even more severe. That left only one solution, which was to give in to his opponent's requests.

source: 见人走远，戚橙雨这才盘脚坐下，开始调息经脉，刚将灵气运转了一个周天。熟悉的女声突然在耳边响起。
en_us: Qi Chengyu made sure that Shen Ying had walked quite a distance away before sitting down in the lotus position. She began to regulate her meridians. Just as her Spirit Qi finished one cycle through her body, a familiar female voice suddenly rang in her ear.

source: 见他不接，她直接塞到了他的手里道，“你也辛苦了，拿着！不用送我了回去吧，有空来无敌派玩哦。再见！”
en_us: When Bai Zhe showed no signs of taking the bag, she directly stuffed it into his hands and said, "You worked hard today. Take it! Don't bother sending me off. Come visit Invincible Sect when you are free. Bye!"

source: 见他们不动，狸猫呆了呆，又从袋子里掏出一碇，跟之前那个并排摆在了一起。
en_us: Seeing no reaction from them, the civet cat pondered for a while and took another gold piece out of his bag, putting it side by side with the other one.

source: 见他们带着千叶草木灵走了，轩辕家的人也无心继续围攻玄天宗了。
en_us: Seeing that Yi Qing, Shen Ying and Lonemoon had taken the Thousand Leaves Vegetation Spirit with them, the people of the Xuan Yuan Family saw no point in surrounding the Blackheaven Sect.

source: 见他们还是不动，狸猫妖干脆一咬牙，直接把袋子里的金子全倒了出来，屋顶顿时哗啦啦的掉了七八碇金子，弱弱的看了他们一眼道，“没……没了喵。”
en_us: Still seeing no reaction, the civet cat demon gritted his teeth and poured out all the gold pieces from his bag. Seven or eight gold pieces slid down from the roof. He looked at them meekly, "No… no more. Meow."

source: 见众人脸色一白，郁海珩越加确定了自己的猜测，未等众人反应，突然手间一转。与刚刚小打小闹似的风刃不同，一条巨大的风龙瞬间出现，围绕着满天的风刃顿时就朝着偏殿呼啸而去。
en_us: When everybody went pale, Yu Hai Heng knew that he had guessed correctly. Before anyone could respond, he twisted his palm. He summoned a gigantic wind blade that made the previous wind blades look like toys. The gigantic wind blade, together with all the smaller wind blades, flew toward the Palace Wing.

source: 见她们落地，快步迎了上来。轩辕禹上前了几步，先是朝着沈萤行了个礼，“大仙。”才转头介绍道，“这位就是印家家主印风。”
en_us: Seeing that Shen Ying's group had arrived, the both of them quickly went to greet them. Stepping forward, Xuan Yuanyu saluted Shen Ying first and said, "Great Immortal." He then turned his head to make the introductions. "This is Yin Feng, the patriarch of the Yin Family."

source: 见她看过去，呆了一下，给了她个小太阳般的笑容。转头看向桌上的一块糕点，一脸跃跃欲试。
en_us: When Ning ZiAn saw that Shen Ying turned around, he was in a trance for a while, before giving her a sunflower like smile. He turned towards the table with the small pastries and his eager face revealed that he wanted to try the food.

source: 见她走了，她干脆换了一个地点调息，然而十分钟后……
en_us: Seeing her walk away, Qi Chengyu decided to choose another place to regulate her meridians. However, ten minutes later…

source: 见她问话，碧涛眼里顿时一亮，乖巧的飘近一点道，“禀大仙，这传承的，是我丹阳宗中所有的丹法丹方，以及制丹心得等等。我丹阳宗在五万年前，就是赫赫有名的第一仙门。门中的丹师无数，多少仙人求上我宗，就为求得一颗丹药。”
en_us: Bitao's eyes lit up on hearing her question. He obediently floated closer to her and answered, "Let me answer you, Great Immortal: my heritage contains all the recipes for all the pills and elixirs of Dan Yang Sect, as well as all the knowledge of refining pills. My Dan Yang Sect was the top Immortal Sect 50,000 years ago. We had countless alchemists and many immortals would come to our sect, begging for just one pill or elixir."

source: 见它一脸誓死不从的样，沈萤转头就看向羿清，“厨子，今天晚上吃萝卜炖排骨吧。”
en_us: Seeing that it did not want to budge, Shen Ying turned to look at Yi Qing and said, "Chef, let's have boiled ribs and radish soup tonight."

source: 见它坐不稳，沈萤从善如流的直接蹲在了它的旁边，呵呵一笑道，“是这样的，我三个刚刚到上青界，没找着地方住。听说你们妖界不像三青界还分上中下的，而且隔着上青界最近，就想问问你有没有合适的地方？”
en_us: Noticing the rabbit’s predicament, Shen Ying directly squatted down beside it. Chuckling, she said, "It's like this.The three of us have just been to the Upper Azure World but couldn't find a place to live. I heard that, unlike the Three Realms, your Demon Realm is not partitioned into upper, middle and lower worlds, and it is also nearest to the Upper Azure Word. I’d like to ask if you have a suitable place for us?"

source: 见对方完全没了反抗，印元飞立马停下了攻击，抱拳道，“道友，承让了！”
en_us: Seeing the opponent not resisting, Yin Yuanfei immediately stopped his attacks and cupped his fists, saying, "Fellow Daoist, thank you!"

source: 见对方确实不动了，已经小了一半大小的鬼王，瞬间化作一股黑气钻回了噬魂幡里，还掩饰性的挪了挪，上面那个已经破碎得只留下几个符文的封印阵，似是拼命想把自己藏到那个符文后面。整个幡旗，瑟瑟发抖！
en_us: Seeing that his opponent was not moving, the Ghost King, who was already half his original size, instantly turned into a black gas and burrowed back into the Soul Devouring Gonfalon. The seal array was so torn that only a few runes could be seen on it. He desperately tried to hide himself behind a rune. The whole flag was shivering!

source: 视线交汇，又是噼哩啪啦的电光声。
en_us: They locked eyes and static filled the air between them once again.

source: 觉得有点冤！
en_us: What a waste of effort!

source: 觉得这个结果，一点都不意外是怎么回事？
en_us: Why wasn’t this result surprising at all to them?

source: 认真挖坑的人一顿，回过头似乎是呆了一下，“咦？原来还没死啊？”她皱了皱眉，叹了口气，这才手脚并用的从坑里爬了出来，一边爬还一边念叨，“早说啊，我挖那么久。”
en_us: The girl earnestly digging at the pit stopped working and turned around. For a moment, there was stunned silence. "Huh? You are not dead after all?" She frowned and sighed, before climbing out of the pit using her hands and feet. While climbing out she kept grumbling, "You should have told me earlier, I was digging for so long."

source: 让他吃惊的是，这些人的毅力。正因为她们知道自己的情况，更是加倍努力日夜不停的修练起来。短短几个月的时间，她们原本停滞不前的修为，居然还真有隐隐松动的趋势，这简直是意外的惊喜，孤月从心底生出一种莫名的骄傲感，不愧是他教出来的人。
en_us: What made him shocked, however, was their determination. It was precisely because they understood their own circumstances that they worked way harder every day and night, training nonstop. Within a few short months, their cultivation which had been stuck on one level actually showed signs of gradually improving which was truly a surprise. Lonemoon felt pride from the bottom of his heart—they were indeed his disciples whom he was teaching to become Sword Cultivators.

source: 让他对付一两个化神还行，十五个化神修士，这不是守护，这就是找死啊！
en_us: He could handle one or two Soul Formations, but asking him to defend against fifteen Soul Formations was asking him to court death!

source: 让他庆幸万分的是，这时不远处的那名管事突然大喊一句，喝止了这护卫。
en_us: Fortunately for him, at that moment that housekeeper suddenly shouted loudly from a not-too-faraway distance, ordering the guard to stop.

source: 让他很郁闷的是，他的黑色元力太少了，仅仅片刻时间后，修炼出来的六缕黑色元力就全部消耗完了。
en_us: What made him dismal was that his black essence force was too little—in only a matter of seconds, the six strands of refined black essence force had been completely consumed.

source: 让他微微心安的是，他跟着这护卫进来后，看到的是一个空旷的大殿，里面一个人也没有，他将斗篷拉低了一些，暗暗祈祷不要遇到江恨水。
en_us: What made his heart relax was that after he had followed that guard in, all he saw was a spacious and empty central hall, with not a single person inside. He allowed himself to lower his cloak slightly, while silently praying that he would not meet Jiang Henshui here.

source: 让他百思不得其解的是，当他运转融合元力开始在伤口附近流转辅助伤口愈合时，却发现疗伤速度和原先蓝色元力一模一样，根本不能增幅。
en_us: What left him perplexed was that, when he circulated the combined essence force near his wounds to facilitate healing, he found out that the healing speed was exactly the same as that of the original blue essence force. The speed would not increase no matter what.

source: 让刘管事傻眼的是，江逸竟突然失踪了，他买通江家下人去探查江逸的情况，却被告知外出三月……
en_us: However, Jiang Yi's sudden disappearance completely derailed Housekeeper Liu, who tried to bribe the servants of the Jiang Clan in an attempt to figure out his whereabouts, but all the information he obtained was that Jiang Yi would be gone for three months...
